app/views/tags/show.html.erb


<% if @tag.products.empty? %>
---
SELECT "products".* FROM "products" INNER JOIN "taggings" ON "products"."id" = "taggings"."product_id" WHERE "taggings"."tag_id" = $1  [["tag_id", 2]]
SELECT 1 AS one FROM "products" INNER JOIN "taggings" ON "products"."id" = "taggings"."product_id" WHERE "taggings"."tag_id" = $1 LIMIT $2  [["tag_id", 2], ["LIMIT", 1]]