app/controllers/categories_controller.rb

SELECT "products".* FROM "products" WHERE "products"."category_id" IN ($1, $2, $3)  [["category_id", 1], ["category_id", 2], ["category_id", 3]]
---
	def show
		@products = Product.where(category_id: [@category.subtree_ids])

INSERT INTO "categories" ("name", "created_at", "updated_at", "ancestry") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Электроника"], ["created_at", "2023-10-30 08:12:05.978970"], ["updated_at", "2023-10-30 08:12:05.978970"], ["ancestry", nil]]
---
	def create
		@category = Category.new(category_params)

		if @category.save

UPDATE "categories" SET "updated_at" = $1, "ancestry" = $2 WHERE "categories"."id" = $3  [["updated_at", "2023-10-30 08:12:12.951369"], ["ancestry", "4"], ["id", 1]]
---
	def update
		if @category.update(category_params)