app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "description", "price", "old_price", "created_at", "updated_at", "category_id", "image") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "old_price" = $1, "updated_at" = $2, "image" = $3 WHERE "products"."id" = $4  [["old_price", "20.0"], ["updated_at", "2023-09-20 09:17:41.731786"], ["image", "Снимок_экрана_от_2023-09-15_15-36-48.png"], ["id", 1]]