app/controllers/tags_controller.rb

SELECT "tags".* FROM "tags" WHERE "tags"."name" = $1 LIMIT $2  [["name", "ророо"], ["LIMIT", 1]]
---
  def show
    @tag = Tag.find_by(name: params[:id])