app/models/product.rb

SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."product_id" = $1  [["product_id", 1]]
---
	def all_tags
    self.tags.map(&:name).join(', ')

SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."product_id" = $1  [["product_id", 1]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "рор"], ["created_at", "2023-10-23 09:21:36.355710"], ["updated_at", "2023-10-23 09:21:36.355710"]]
SELECT "tags".* FROM "tags" WHERE "tags"."name" = $1 ORDER BY "tags"."id" ASC LIMIT $2  [["name", "рор"], ["LIMIT", 1]]
---
  def all_tags=(names)
    self.tags = names.split(',').map do |name|
      Tag.where(name: name.strip).first_or_create!