app/views/products/_form.html.erb

SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC
---
      <%= form.label :category_id, class: "form-label" %>
      <%= form.collection_select :category_id,
                                  Category.order(:name),
                                  :id, :name,
                                  {include_blank: true},
                                  class: "form-select" %>